export const majorCategoryObj: {[key:number] : string} = {
    0: "選択されていません",
    11: "山岳",
    12: "高原・湿原・原野",
    13: "湖沼",
    14: "河川・渓谷",
    15: "滝",
    16: "海岸・岬",
    17: "岩石・洞窟",
    18: "動物",
    19: "植物",
    20: "自然現象",
    21: "史跡",
    22: "神社・寺院・教会",
    23: "城跡・城郭・宮殿",
    24: "集落・街",
    25: "郷土景観",
    26: "庭園・公園",
    27: "建造物",
    28: "年中行事（祭り・伝統行事）",
    39: "動植物園・水族館",
    30: "博物館・美術館",
    31: "テーマ公園・テーマ施設",
    32: "温泉",
    33: "食",
    34: "芸能・イベント"
};

export const langCategoryObj: {[key: string]: string} = {
    "ja": "日本語",
    "en": "英語",
    "zh-CN": "中国語（簡体字）",
    "zh-TW": "中国語（繁体字）",
    "ko": "韓国語"
}

export const countryCategoryObj: {[key: string]: string[]} = {
    "tohoku": ["北海道", "青森", "秋田", "岩手", "山形", "宮城", "福島"],
    "kanto": ["東京", "神奈川", "千葉", "埼玉", "茨城", "栃木", "群馬"],
    "chubu": ["愛知", "山梨", "長野", "石川", "富山", "福井", "岐阜", "静岡", "三重"],
    "kansai": ["大阪", "京都", "兵庫", "滋賀", "奈良", "和歌山"],
    "chuboku": ["広島", "岡山", "島根", "鳥取", "山口", "香川", "愛媛", "徳島", "高知"],
    "kyusyu": ["福岡", "熊本", "大分", "佐賀", "長崎", "宮崎", "鹿児島", "沖縄"]
}

export const majorCategoryChipObj: {[key:number] : string} = {
    11: "山岳",
    12: "高原・湿原・原野",
    13: "湖沼",
    14: "河川・渓谷",
    15: "滝",
    16: "海岸・岬",
    17: "岩石・洞窟",
    18: "動物",
    19: "植物",
    20: "自然現象",
    21: "史跡",
    22: "神社・寺院・教会",
    23: "城跡・城郭・宮殿",
    24: "集落・街",
    25: "郷土景観",
    26: "庭園・公園",
    27: "建造物",
    28: "年中行事（祭り・伝統行事）",
    39: "動植物園・水族館",
    30: "博物館・美術館",
    31: "テーマ公園・テーマ施設",
    32: "温泉",
    33: "食",
    34: "芸能・イベント"
};